[
    {
        "timestamp": "2025-06-07T20:59:00.344714",
        "question": "bonjour",
        "response": "Bonjour !\n\nEn 1990, l'inflation était de 11.78.\n\nJe n'ai pas d'informations supplémentaires sur ce qui a pu influencer l'inflation en 1990."
    },
    {
        "timestamp": "2025-06-07T21:00:53.425948",
        "question": "bonjour",
        "response": "Bonjour !\n\nVoici les informations concernant l'inflation en 1990 :\n\nL'inflation en 1990 était de 11.78.\n\nAucune information supplémentaire n'est disponible dans le contexte fourni pour compléter cette donnée."
    },
    {
        "timestamp": "2025-06-07T21:01:54.267634",
        "question": "inflation en 2024",
        "response": "Bonjour !\n\nL'inflation en 2024 est de 9.87%. Cette information est tirée de données actuelles. La croissance devrait reprendre à un rythme plus lent que prévu en 2024. Le déficit budgétaire devrait se réduire progressivement pour atteindre 5 pour cent en 2024. La reprise attendue de l’activité économique en 2023-24 se traduira par une baisse progressive des taux de pauvreté, d’un niveau historique de 81 pour cent en 2020 à 79,9 pour cent en 2024. Les perspectives économiques relativement moroses se traduisent par un taux de pauvreté qui resterait proche de 80 pour cent jusqu’en 2024."
    },
    {
        "timestamp": "2025-06-07T21:03:39.735547",
        "question": "PIB en 2002",
        "response": "Bonjour !\n\nConcernant le PIB en 2002, je ne dispose pas de cette information."
    },
    {
        "timestamp": "2025-06-07T21:04:25.774749",
        "question": "PIB en 2018",
        "response": "Bonjour !\n\nJe ne dispose pas de l'information chiffrée concernant le PIB en 2018."
    },
    {
        "timestamp": "2025-06-07T21:04:56.235343",
        "question": "PIB en 2018",
        "response": "Bonjour !\n\nLe PIB en 2018 était de 12 629 254 472,2."
    },
    {
        "timestamp": "2025-06-07T21:10:48.348347",
        "question": "donne moi la valeur du PIB en 2018",
        "response": "Bonjour !\n\nEn 2018, le PIB s'élevait à 12 629 254 472,2.\n\nEn 2018, on observe que :\n*   Les exportations étaient de 31,54.\n*   Les importations étaient de 36,31.\n*   Le PIB par habitant était de 459,33.\n*   La participation au marché du travail était de 85,46.\n*   Le taux de change officiel était de 3 334,75.\n*   Les dépenses publiques étaient de 9,83.\n*   Le taux de chômage était de 2,3.\n*   L'inflation était de 8,59.\n*   Les investissements directs étrangers (IDE) entrants nets étaient de 4,45.\n*   Les investissements directs étrangers (IDE) sortants nets étaient de 0,86.\n*   La prévision du PIB était de 12 604 372 016,65."
    },
    {
        "timestamp": "2025-06-07T21:13:32.923090",
        "question": "PIB en 2018 etait combien?",
        "response": "Bonjour !\n\nLe PIB en 2018 était de 12629254472.2."
    },
    {
        "timestamp": "2025-06-07T21:22:01.293787",
        "question": "comment était le PIB en 2021",
        "response": "Bonjour !\n\nEn 2021, le PIB était de 12947986307.59. La reprise de la mine d’Ambatovy en mars 2021 a contribué à une reprise plus rapide que prévu de la croissance du PIB au cours du troisième trimestre 2021."
    },
    {
        "timestamp": "2025-06-07T21:23:23.504295",
        "question": "comment était le PIB en 2024",
        "response": "Bonjour !\n\nEn 2024, le PIB était de 13 977 610 178.6. On dispose également d'une prévision du PIB pour 2024 qui est de 13 852 456 680.04."
    },
    {
        "timestamp": "2025-06-07T21:24:21.034276",
        "question": "comment était le PIB en 1988",
        "response": "Bonjour !\n\nEn 1988, le PIB était de 6048934315.21."
    },
    {
        "timestamp": "2025-06-07T21:24:58.341382",
        "question": "comment était le PIB en 1989",
        "response": "Bonjour !\n\nEn 1989, le PIB était de 6 295 421 169,57."
    },
    {
        "timestamp": "2025-06-07T21:26:11.020832",
        "question": "comment était la renumeration des employe en 2013",
        "response": "Bonjour !\n\nConcernant la rémunération des employés en 2013, je ne dispose pas de cette information. Cependant, en 2013, les dépenses publiques d'éducation s'élevaient à 13,99%."
    },
    {
        "timestamp": "2025-06-07T21:26:51.569233",
        "question": "comment était la renumeration des employe",
        "response": "Bonjour !\n\nEn ce qui concerne la rémunération des employés en 1983, je ne dispose pas de cette information.\n\nCependant, d'après les documents disponibles, il est noté que les retards de paiement des salaires ont un impact particulièrement important sur les directeurs d’école et les enseignants fonctionnaires. De plus, un grand nombre de répondants déclarent que leurs revenus ne suffisent pas à subvenir à leurs besoins."
    },
    {
        "timestamp": "2025-06-07T21:28:27.262200",
        "question": "comment était la renumeration des employe en 1980",
        "response": "Bonjour !\n\nEn 1980, la rémunération des employés était de 0.0. Ce chiffre est issu des données sur les dépenses."
    },
    {
        "timestamp": "2025-06-07T21:29:12.050688",
        "question": "comment était la renumeration des employe en 2000",
        "response": "Bonjour !\n\nEn 2000, la rémunération des employés était de 31.59.\n\nCette donnée fait partie des dépenses, où les dépenses publiques étaient de 6.69 et les dépenses nationales brutes de 109.78. Les dépenses de consommation finale étaient de 88.34."
    },
    {
        "timestamp": "2025-06-07T21:30:25.669609",
        "question": "parlez moi du  Dépenses publiques d'éducation en 2016",
        "response": "Bonjour !\n\nEn 2016, les dépenses publiques d'éducation s'élevaient à 19.58.\n\nLe gouvernement a récemment mis en place un fonds scolaire unique harmonisé avec une nouvelle formule de distribution qui prend en compte des critères supplémentaires tels que l’équité et la performance. Il prévoit également d’augmenter le montant des subventions aux établissements afin de mieux répondre à leurs besoins opérationnels de base et d’améliorer la rapidité des transferts. L’introduction de méthodes de paiement numériques et mobiles pourrait être envisagée."
    }
]